Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
// CR Configuration

#define GTZC1_MPCBB3_CR_SRWILADIS       (0x1U<<31)
#define GTZC1_MPCBB3_CR_INVSECSTATE     (0x1U<<30)
#define GTZC1_MPCBB3_CR_GLOCK           (0x1U<<0)

// CFGLOCK1 Configuration

#define GTZC1_MPCBB3_CFGLOCK1_SPLCK31   (0x1U<<31)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK30   (0x1U<<30)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK29   (0x1U<<29)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK28   (0x1U<<28)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK27   (0x1U<<27)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK26   (0x1U<<26)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK25   (0x1U<<25)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK24   (0x1U<<24)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK23   (0x1U<<23)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK22   (0x1U<<22)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK21   (0x1U<<21)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK20   (0x1U<<20)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK19   (0x1U<<19)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK18   (0x1U<<18)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK17   (0x1U<<17)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK16   (0x1U<<16)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK15   (0x1U<<15)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK14   (0x1U<<14)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK13   (0x1U<<13)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK12   (0x1U<<12)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK11   (0x1U<<11)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK10   (0x1U<<10)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK9    (0x1U<<9)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK8    (0x1U<<8)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK7    (0x1U<<7)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK6    (0x1U<<6)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK5    (0x1U<<5)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK4    (0x1U<<4)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK3    (0x1U<<3)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK2    (0x1U<<2)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK1    (0x1U<<1)
#define GTZC1_MPCBB3_CFGLOCK1_SPLCK0    (0x1U<<0)

// CFGLOCK2 Configuration

#define GTZC1_MPCBB3_CFGLOCK2_SPLCK51   (0x1U<<19)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK50   (0x1U<<18)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK49   (0x1U<<17)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK48   (0x1U<<16)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK47   (0x1U<<15)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK46   (0x1U<<14)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK45   (0x1U<<13)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK44   (0x1U<<12)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK43   (0x1U<<11)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK42   (0x1U<<10)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK41   (0x1U<<9)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK40   (0x1U<<8)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK39   (0x1U<<7)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK38   (0x1U<<6)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK37   (0x1U<<5)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK36   (0x1U<<4)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK35   (0x1U<<3)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK34   (0x1U<<2)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK33   (0x1U<<1)
#define GTZC1_MPCBB3_CFGLOCK2_SPLCK32   (0x1U<<0)

// SECCFGR0 Configuration

#define GTZC1_MPCBB3_SECCFGR0_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR0_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR0_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR0_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR0_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR0_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR0_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR0_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR0_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR0_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR0_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR0_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR0_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR0_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR0_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR0_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR0_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR0_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR0_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR0_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR0_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR0_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR0_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR0_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR0_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR0_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR0_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR0_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR0_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR0_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR0_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR0_SEC0      (0x1U<<0)

// SECCFGR1 Configuration

#define GTZC1_MPCBB3_SECCFGR1_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR1_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR1_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR1_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR1_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR1_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR1_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR1_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR1_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR1_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR1_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR1_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR1_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR1_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR1_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR1_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR1_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR1_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR1_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR1_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR1_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR1_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR1_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR1_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR1_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR1_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR1_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR1_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR1_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR1_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR1_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR1_SEC0      (0x1U<<0)

// SECCFGR2 Configuration

