Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
#define GTZC1_MPCBB3_SECCFGR2_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR2_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR2_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR2_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR2_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR2_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR2_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR2_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR2_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR2_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR2_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR2_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR2_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR2_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR2_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR2_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR2_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR2_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR2_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR2_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR2_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR2_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR2_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR2_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR2_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR2_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR2_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR2_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR2_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR2_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR2_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR2_SEC0      (0x1U<<0)

// SECCFGR3 Configuration

#define GTZC1_MPCBB3_SECCFGR3_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR3_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR3_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR3_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR3_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR3_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR3_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR3_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR3_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR3_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR3_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR3_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR3_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR3_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR3_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR3_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR3_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR3_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR3_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR3_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR3_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR3_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR3_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR3_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR3_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR3_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR3_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR3_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR3_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR3_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR3_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR3_SEC0      (0x1U<<0)

// SECCFGR4 Configuration

#define GTZC1_MPCBB3_SECCFGR4_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR4_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR4_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR4_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR4_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR4_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR4_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR4_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR4_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR4_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR4_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR4_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR4_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR4_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR4_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR4_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR4_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR4_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR4_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR4_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR4_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR4_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR4_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR4_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR4_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR4_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR4_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR4_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR4_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR4_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR4_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR4_SEC0      (0x1U<<0)

// SECCFGR5 Configuration

#define GTZC1_MPCBB3_SECCFGR5_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR5_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR5_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR5_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR5_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR5_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR5_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR5_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR5_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR5_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR5_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR5_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR5_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR5_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR5_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR5_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR5_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR5_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR5_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR5_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR5_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR5_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR5_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR5_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR5_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR5_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR5_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR5_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR5_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR5_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR5_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR5_SEC0      (0x1U<<0)

// SECCFGR6 Configuration

