Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
#define GTZC1_MPCBB3_SECCFGR6_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR6_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR6_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR6_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR6_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR6_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR6_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR6_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR6_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR6_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR6_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR6_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR6_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR6_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR6_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR6_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR6_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR6_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR6_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR6_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR6_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR6_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR6_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR6_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR6_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR6_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR6_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR6_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR6_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR6_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR6_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR6_SEC0      (0x1U<<0)

// SECCFGR7 Configuration

#define GTZC1_MPCBB3_SECCFGR7_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR7_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR7_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR7_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR7_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR7_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR7_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR7_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR7_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR7_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR7_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR7_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR7_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR7_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR7_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR7_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR7_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR7_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR7_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR7_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR7_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR7_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR7_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR7_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR7_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR7_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR7_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR7_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR7_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR7_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR7_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR7_SEC0      (0x1U<<0)

// SECCFGR8 Configuration

#define GTZC1_MPCBB3_SECCFGR8_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR8_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR8_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR8_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR8_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR8_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR8_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR8_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR8_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR8_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR8_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR8_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR8_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR8_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR8_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR8_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR8_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR8_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR8_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR8_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR8_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR8_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR8_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR8_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR8_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR8_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR8_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR8_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR8_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR8_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR8_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR8_SEC0      (0x1U<<0)

// SECCFGR9 Configuration

#define GTZC1_MPCBB3_SECCFGR9_SEC31     (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR9_SEC30     (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR9_SEC29     (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR9_SEC28     (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR9_SEC27     (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR9_SEC26     (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR9_SEC25     (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR9_SEC24     (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR9_SEC23     (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR9_SEC22     (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR9_SEC21     (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR9_SEC20     (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR9_SEC19     (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR9_SEC18     (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR9_SEC17     (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR9_SEC16     (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR9_SEC15     (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR9_SEC14     (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR9_SEC13     (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR9_SEC12     (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR9_SEC11     (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR9_SEC10     (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR9_SEC9      (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR9_SEC8      (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR9_SEC7      (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR9_SEC6      (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR9_SEC5      (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR9_SEC4      (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR9_SEC3      (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR9_SEC2      (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR9_SEC1      (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR9_SEC0      (0x1U<<0)

// SECCFGR10 Configuration

#define GTZC1_MPCBB3_SECCFGR10_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR10_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR10_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR10_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR10_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR10_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR10_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR10_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR10_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR10_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR10_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR10_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR10_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR10_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR10_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR10_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR10_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR10_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR10_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR10_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR10_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR10_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR10_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR10_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR10_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR10_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR10_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR10_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR10_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR10_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR10_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR10_SEC0     (0x1U<<0)

// SECCFGR11 Configuration

#define GTZC1_MPCBB3_SECCFGR11_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR11_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR11_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR11_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR11_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR11_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR11_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR11_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR11_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR11_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR11_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR11_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR11_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR11_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR11_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR11_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR11_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR11_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR11_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR11_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR11_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR11_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR11_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR11_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR11_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR11_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR11_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR11_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR11_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR11_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR11_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR11_SEC0     (0x1U<<0)

// SECCFGR12 Configuration

#define GTZC1_MPCBB3_SECCFGR12_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR12_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR12_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR12_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR12_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR12_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR12_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR12_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR12_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR12_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR12_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR12_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR12_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR12_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR12_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR12_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR12_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR12_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR12_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR12_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR12_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR12_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR12_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR12_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR12_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR12_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR12_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR12_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR12_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR12_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR12_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR12_SEC0     (0x1U<<0)

// SECCFGR13 Configuration

