Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
#define GTZC1_MPCBB3_SECCFGR13_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR13_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR13_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR13_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR13_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR13_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR13_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR13_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR13_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR13_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR13_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR13_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR13_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR13_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR13_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR13_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR13_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR13_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR13_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR13_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR13_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR13_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR13_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR13_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR13_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR13_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR13_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR13_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR13_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR13_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR13_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR13_SEC0     (0x1U<<0)

// SECCFGR14 Configuration

#define GTZC1_MPCBB3_SECCFGR14_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR14_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR14_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR14_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR14_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR14_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR14_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR14_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR14_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR14_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR14_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR14_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR14_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR14_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR14_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR14_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR14_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR14_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR14_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR14_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR14_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR14_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR14_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR14_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR14_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR14_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR14_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR14_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR14_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR14_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR14_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR14_SEC0     (0x1U<<0)

// SECCFGR15 Configuration

#define GTZC1_MPCBB3_SECCFGR15_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR15_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR15_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR15_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR15_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR15_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR15_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR15_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR15_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR15_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR15_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR15_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR15_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR15_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR15_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR15_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR15_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR15_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR15_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR15_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR15_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR15_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR15_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR15_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR15_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR15_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR15_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR15_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR15_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR15_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR15_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR15_SEC0     (0x1U<<0)

// SECCFGR16 Configuration

#define GTZC1_MPCBB3_SECCFGR16_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR16_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR16_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR16_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR16_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR16_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR16_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR16_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR16_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR16_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR16_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR16_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR16_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR16_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR16_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR16_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR16_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR16_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR16_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR16_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR16_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR16_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR16_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR16_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR16_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR16_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR16_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR16_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR16_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR16_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR16_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR16_SEC0     (0x1U<<0)

