Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
// SECCFGR21 Configuration

#define GTZC1_MPCBB3_SECCFGR21_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR21_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR21_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR21_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR21_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR21_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR21_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR21_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR21_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR21_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR21_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR21_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR21_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR21_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR21_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR21_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR21_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR21_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR21_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR21_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR21_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR21_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR21_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR21_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR21_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR21_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR21_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR21_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR21_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR21_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR21_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR21_SEC0     (0x1U<<0)

// SECCFGR22 Configuration

#define GTZC1_MPCBB3_SECCFGR22_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR22_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR22_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR22_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR22_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR22_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR22_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR22_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR22_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR22_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR22_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR22_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR22_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR22_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR22_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR22_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR22_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR22_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR22_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR22_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR22_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR22_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR22_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR22_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR22_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR22_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR22_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR22_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR22_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR22_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR22_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR22_SEC0     (0x1U<<0)

// SECCFGR23 Configuration

#define GTZC1_MPCBB3_SECCFGR23_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR23_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR23_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR23_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR23_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR23_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR23_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR23_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR23_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR23_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR23_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR23_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR23_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR23_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR23_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR23_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR23_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR23_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR23_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR23_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR23_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR23_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR23_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR23_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR23_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR23_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR23_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR23_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR23_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR23_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR23_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR23_SEC0     (0x1U<<0)

// SECCFGR24 Configuration

#define GTZC1_MPCBB3_SECCFGR24_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR24_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR24_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR24_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR24_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR24_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR24_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR24_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR24_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR24_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR24_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR24_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR24_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR24_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR24_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR24_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR24_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR24_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR24_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR24_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR24_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR24_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR24_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR24_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR24_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR24_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR24_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR24_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR24_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR24_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR24_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR24_SEC0     (0x1U<<0)

// SECCFGR25 Configuration

#define GTZC1_MPCBB3_SECCFGR25_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR25_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR25_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR25_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR25_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR25_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR25_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR25_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR25_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR25_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR25_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR25_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR25_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR25_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR25_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR25_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR25_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR25_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR25_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR25_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR25_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR25_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR25_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR25_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR25_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR25_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR25_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR25_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR25_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR25_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR25_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR25_SEC0     (0x1U<<0)

// SECCFGR26 Configuration

#define GTZC1_MPCBB3_SECCFGR26_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR26_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR26_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR26_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR26_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR26_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR26_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR26_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR26_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR26_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR26_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR26_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR26_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR26_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR26_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR26_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR26_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR26_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR26_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR26_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR26_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR26_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR26_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR26_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR26_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR26_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR26_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR26_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR26_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR26_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR26_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR26_SEC0     (0x1U<<0)

// SECCFGR27 Configuration

#define GTZC1_MPCBB3_SECCFGR27_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR27_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR27_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR27_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR27_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR27_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR27_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR27_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR27_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR27_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR27_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR27_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR27_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR27_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR27_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR27_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR27_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR27_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR27_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR27_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR27_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR27_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR27_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR27_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR27_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR27_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR27_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR27_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR27_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR27_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR27_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR27_SEC0     (0x1U<<0)

// SECCFGR28 Configuration

#define GTZC1_MPCBB3_SECCFGR28_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR28_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR28_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR28_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR28_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR28_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR28_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR28_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR28_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR28_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR28_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR28_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR28_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR28_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR28_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR28_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR28_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR28_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR28_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR28_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR28_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR28_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR28_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR28_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR28_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR28_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR28_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR28_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR28_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR28_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR28_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR28_SEC0     (0x1U<<0)

// SECCFGR29 Configuration

#define GTZC1_MPCBB3_SECCFGR29_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR29_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR29_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR29_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR29_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR29_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR29_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR29_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR29_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR29_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR29_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR29_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR29_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR29_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR29_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR29_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR29_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR29_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR29_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR29_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR29_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR29_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR29_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR29_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR29_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR29_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR29_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR29_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR29_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR29_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR29_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR29_SEC0     (0x1U<<0)

// SECCFGR30 Configuration

#define GTZC1_MPCBB3_SECCFGR30_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR30_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR30_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR30_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR30_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR30_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR30_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR30_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR30_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR30_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR30_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR30_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR30_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR30_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR30_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR30_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR30_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR30_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR30_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR30_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR30_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR30_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR30_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR30_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR30_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR30_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR30_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR30_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR30_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR30_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR30_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR30_SEC0     (0x1U<<0)

// SECCFGR31 Configuration

#define GTZC1_MPCBB3_SECCFGR31_SEC31    (0x1U<<31)
#define GTZC1_MPCBB3_SECCFGR31_SEC30    (0x1U<<30)
#define GTZC1_MPCBB3_SECCFGR31_SEC29    (0x1U<<29)
#define GTZC1_MPCBB3_SECCFGR31_SEC28    (0x1U<<28)
#define GTZC1_MPCBB3_SECCFGR31_SEC27    (0x1U<<27)
#define GTZC1_MPCBB3_SECCFGR31_SEC26    (0x1U<<26)
#define GTZC1_MPCBB3_SECCFGR31_SEC25    (0x1U<<25)
#define GTZC1_MPCBB3_SECCFGR31_SEC24    (0x1U<<24)
#define GTZC1_MPCBB3_SECCFGR31_SEC23    (0x1U<<23)
#define GTZC1_MPCBB3_SECCFGR31_SEC22    (0x1U<<22)
#define GTZC1_MPCBB3_SECCFGR31_SEC21    (0x1U<<21)
#define GTZC1_MPCBB3_SECCFGR31_SEC20    (0x1U<<20)
#define GTZC1_MPCBB3_SECCFGR31_SEC19    (0x1U<<19)
#define GTZC1_MPCBB3_SECCFGR31_SEC18    (0x1U<<18)
#define GTZC1_MPCBB3_SECCFGR31_SEC17    (0x1U<<17)
#define GTZC1_MPCBB3_SECCFGR31_SEC16    (0x1U<<16)
#define GTZC1_MPCBB3_SECCFGR31_SEC15    (0x1U<<15)
#define GTZC1_MPCBB3_SECCFGR31_SEC14    (0x1U<<14)
#define GTZC1_MPCBB3_SECCFGR31_SEC13    (0x1U<<13)
#define GTZC1_MPCBB3_SECCFGR31_SEC12    (0x1U<<12)
#define GTZC1_MPCBB3_SECCFGR31_SEC11    (0x1U<<11)
#define GTZC1_MPCBB3_SECCFGR31_SEC10    (0x1U<<10)
#define GTZC1_MPCBB3_SECCFGR31_SEC9     (0x1U<<9)
#define GTZC1_MPCBB3_SECCFGR31_SEC8     (0x1U<<8)
#define GTZC1_MPCBB3_SECCFGR31_SEC7     (0x1U<<7)
#define GTZC1_MPCBB3_SECCFGR31_SEC6     (0x1U<<6)
#define GTZC1_MPCBB3_SECCFGR31_SEC5     (0x1U<<5)
#define GTZC1_MPCBB3_SECCFGR31_SEC4     (0x1U<<4)
#define GTZC1_MPCBB3_SECCFGR31_SEC3     (0x1U<<3)
#define GTZC1_MPCBB3_SECCFGR31_SEC2     (0x1U<<2)
#define GTZC1_MPCBB3_SECCFGR31_SEC1     (0x1U<<1)
#define GTZC1_MPCBB3_SECCFGR31_SEC0     (0x1U<<0)

