Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR10_PRIV0   (0x1U<<0)

// PRIVCFGR11 Configuration

#define GTZC1_MPCBB3_PRIVCFGR11_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR11_PRIV0   (0x1U<<0)

// PRIVCFGR12 Configuration

#define GTZC1_MPCBB3_PRIVCFGR12_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR12_PRIV0   (0x1U<<0)

// PRIVCFGR13 Configuration

#define GTZC1_MPCBB3_PRIVCFGR13_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR13_PRIV0   (0x1U<<0)

// PRIVCFGR14 Configuration

#define GTZC1_MPCBB3_PRIVCFGR14_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR14_PRIV0   (0x1U<<0)

// PRIVCFGR15 Configuration

#define GTZC1_MPCBB3_PRIVCFGR15_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR15_PRIV0   (0x1U<<0)

// PRIVCFGR16 Configuration

#define GTZC1_MPCBB3_PRIVCFGR16_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR16_PRIV0   (0x1U<<0)

// PRIVCFGR17 Configuration

#define GTZC1_MPCBB3_PRIVCFGR17_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR17_PRIV0   (0x1U<<0)

// PRIVCFGR18 Configuration

#define GTZC1_MPCBB3_PRIVCFGR18_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR18_PRIV0   (0x1U<<0)

// PRIVCFGR19 Configuration

