Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb3.h
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR34_PRIV0   (0x1U<<0)

// PRIVCFGR35 Configuration

#define GTZC1_MPCBB3_PRIVCFGR35_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR35_PRIV0   (0x1U<<0)

// PRIVCFGR36 Configuration

#define GTZC1_MPCBB3_PRIVCFGR36_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR36_PRIV0   (0x1U<<0)

// PRIVCFGR37 Configuration

#define GTZC1_MPCBB3_PRIVCFGR37_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR37_PRIV0   (0x1U<<0)

// PRIVCFGR38 Configuration

#define GTZC1_MPCBB3_PRIVCFGR38_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR38_PRIV0   (0x1U<<0)

// PRIVCFGR39 Configuration

#define GTZC1_MPCBB3_PRIVCFGR39_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR39_PRIV0   (0x1U<<0)

// PRIVCFGR40 Configuration

#define GTZC1_MPCBB3_PRIVCFGR40_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR40_PRIV0   (0x1U<<0)

// PRIVCFGR41 Configuration

#define GTZC1_MPCBB3_PRIVCFGR41_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR41_PRIV0   (0x1U<<0)

// PRIVCFGR42 Configuration

#define GTZC1_MPCBB3_PRIVCFGR42_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR42_PRIV0   (0x1U<<0)

// PRIVCFGR43 Configuration

#define GTZC1_MPCBB3_PRIVCFGR43_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB3_PRIVCFGR43_PRIV0   (0x1U<<0)

